//=============================================================================
//
// タイトル画面処理 [title.cpp]
// Author : Yanagisawa Yuta
//
//=============================================================================
#include "title.h"
#include "input.h"
#include "texture.h"
#include "sprite.h"
#include "fade.h"
#include "sound.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************



//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************


//*****************************************************************************
// グローバル変数
//*****************************************************************************
static int	g_TextureNo = 0;	// テクスチャ情報
static int	g_BGMNo = 0;		// BGM識別子

								//=============================================================================
// 初期化処理
//=============================================================================
HRESULT InitTitle(void)
{
	//テクスチャ生成
	g_TextureNo = LoadTexture((char*)"data/TEXTURE/タイトル1.png");

	g_BGMNo = LoadSound((char*)"data/BGM/kanatanouchuu.wav");

	//255(-1)をループ指定すると無限ループ
	SetVolume(g_BGMNo, 0.25f);
	PlaySound(g_BGMNo, -1);

	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void UninitTitle(void)
{
	StopSoundAll();
}

//=============================================================================
// 更新処理
//=============================================================================
void UpdateTitle(void)
{
	if (GetKeyboardTrigger(DIK_RETURN) || IsMouseLeftTriggered() 
		&& GetFadeState() == FADE_NONE )
	{
		if (GetOnceTutorial() == false) {
			SceneTransition(SCENE_TUTORIAL);
			SetOnceTutorial(true);
		}
		else {
			SceneTransition(SCENE_GAME);
		}
		
	}
}

//=============================================================================
// 描画処理
//=============================================================================
void DrawTitle(void)
{
	// １枚のポリゴンの頂点とテクスチャ座標を設定
	DrawSpriteLeftTop(g_TextureNo, 0.0f, 0.0f, SCREEN_WIDTH, SCREEN_HEIGHT, 0.0f, 0.0f, 1.0f, 1.0f);

}

