//=============================================================================
//
// リザルト画面処理 [result.cpp]
// Author : 
//
//=============================================================================
#include "gameOver.h"
#include "input.h"
#include "texture.h"
#include "sprite.h"
#include "fade.h"
#include "sound.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************


//*****************************************************************************
// グローバル変数
//*****************************************************************************
static int	g_TextureNo = 0;	// テクスチャ情報

//	サウンド用のインデックス
static int g_SoundIndex = 0;

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT InitGameOver(void)
{
	StopSoundAll();

	g_TextureNo = LoadTexture("data/TEXTURE/gameOver.png");


	g_SoundIndex = LoadSound("data/BGM/gameover.wav");

	//	第一引数ー＞グローバル変数、第二引数ー＞0～1までの数値
	//で音量が設定できます
	SetVolume(g_SoundIndex, 0.5f);

	PlaySound(g_SoundIndex, 256);


	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void UninitGameOver(void)
{
	StopSound(g_SoundIndex);
}

//=============================================================================
// 更新処理
//=============================================================================
void UpdateGameOver(void)
{
	if (GetKeyboardTrigger(DIK_RETURN) && GetFadeState() == FADE_NONE)
	{
		SceneTransition(SCENE_TITLE);
	}
}

//=============================================================================
// 描画処理
//=============================================================================
void DrawGameOver(void)
{
	// １枚のポリゴンの頂点とテクスチャ座標を設定
	DrawSpriteLeftTop(g_TextureNo, 0.0f, 0.0f, SCREEN_WIDTH, SCREEN_HEIGHT, 0.0f, 0.0f, 1.0f, 1.0f);
}